In [38]:
import pandas as pd
import numpy as np

from sklearn.preprocessing import StandardScaler
from sklearn.cluster import KMeans

In [39]:
data = pd.read_csv('data_modified.csv')

In [40]:
data.head()

,Age,Education_Level,Occupation,Number_of_Dependents,Location,Work_Experience,Marital_Status,Employment_Status,Household_Size,Homeownership_Status,Type_of_Housing,Gender,Primary_Mode_of_Transportation,Income,Age_Group,Living_Standards,Cluster
0,56,Master's,Technology,5,Urban,21,Married,Full-time,7,Own,Apartment,Male,Public transit,72510,46-60,Medium,2
1,69,High School,Finance,0,Urban,4,Single,Full-time,7,Own,Apartment,Male,Biking,75462,61-75,Medium,2
2,46,Bachelor's,Technology,1,Urban,1,Single,Full-time,7,Own,Single-family home,Female,Car,71748,46-60,Medium,2
3,32,High School,Others,2,Urban,32,Married,Full-time,1,Own,Apartment,Female,Car,74520,31-45,Medium,1
4,60,Bachelor's,Finance,3,Urban,15,Married,Self-employed,4,Own,Townhouse,Male,Walking,640210,46-60,High,2

In [47]:
object_columns = data.select_dtypes(include='object')

In [48]:
for column in object_columns.columns:
    print(f"Unique values in {column}: {object_columns[column].unique()}")

Unique values in Education_Level: ["Master's" 'High School' "Bachelor's" 'Doctorate']
Unique values in Occupation: ['Technology' 'Finance' 'Others' 'Education' 'Healthcare']
Unique values in Location: ['Urban' 'Rural' 'Suburban']
Unique values in Marital_Status: ['Married' 'Single' 'Divorced']
Unique values in Employment_Status: ['Full-time' 'Self-employed' 'Part-time']
Unique values in Homeownership_Status: ['Own' 'Rent']
Unique values in Type_of_Housing: ['Apartment' 'Single-family home' 'Townhouse']
Unique values in Gender: ['Male' 'Female']
Unique values in Primary_Mode_of_Transportation: ['Public transit' 'Biking' 'Car' 'Walking']
Unique values in Age_Group: ['46-60' '61-75' '31-45' '15-30']
Unique values in Living_Standards: ['Medium' 'High' 'Low']

In [20]:
features = ['Age', 'Work_Experience', 'Household_Size', 'Income']

In [21]:
sample = data[features]

In [22]:
sample.head()

   Age  Work_Experience  Household_Size  Income
0   56               21               7   72510
1   69                4               7   75462
2   46                1               7   71748
3   32               32               1   74520
4   60               15               4  640210

In [25]:
income_mapping = {
                "Low": 64207.0,
                "Medium": 77808.0,
                "High": 2485100.0
            }

In [27]:
sample.head()

   Age  Work_Experience  Household_Size  Income
0   56               21               7   72510
1   69                4               7   75462
2   46                1               7   71748
3   32               32               1   74520
4   60               15               4  640210

In [28]:
sample.rename(columns={'Living_Standards': 'Income'}, inplace=True)

C:\Users\Shubham\AppData\Local\Temp\ipykernel_1640\684691776.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  sample.rename(columns={'Living_Standards': 'Income'}, inplace=True)

In [29]:
sample.head()

   Age  Work_Experience  Household_Size  Income
0   56               21               7   72510
1   69                4               7   75462
2   46                1               7   71748
3   32               32               1   74520
4   60               15               4  640210

In [30]:
sample_random_subset = sample.sample(frac=0.30)

In [31]:
sample_random_subset.head()

      Age  Work_Experience  Household_Size   Income
7129   41               49               6    68754
9782   35                0               4    65334
4660   59               42               6    65896
5834   52               10               2  1080988
4522   61                5               6    43789

In [32]:
sample_random_subset.to_csv('kmeans.csv')